[
    {
        "id": 1,
        "title": "Перша стаття: Вступ до FastAPI",
        "slug": "persha-stattya-vstup-do-fastapi",
        "content": "FastAPI – це веб-фреймворк для тих, хто вважає, що повільні API – то вже вчорашній день. Працює швидко, неначе кавун по похилій.",
        "author": "Гуру Бізнес-Кежуал",
        "date": "2024-05-10"
    },
    {
        "id": 2,
        "title": "Друга стаття: Основи HTML та CSS",
        "slug": "druha-stattya-osnovy-html-ta-css",
        "content": "Якщо без HTML та CSS ваш сайт виглядає як текст у блокноті – ця стаття для вас.",
        "author": "Автор 2",
        "date": "2024-05-11"
    },
    {
        "id": 3,
        "title": "Третя стаття: JavaScript для початківців",
        "slug": "tretya-stattya-javascript-dlya-pochatkivtsiv",
        "content": "JavaScript – це коли браузер виконує код так само неочікувано, як ви реагуєте на повідомлення від колишніх.",
        "author": "Містер Асинхрон",
        "date": "2024-05-12"
    },
    {
        "id": 4,
        "title": "Четверта стаття: Введення в Python",
        "slug": "chetverta-stattya-vvedennya-v-python",
        "content": "Python – мова така дружелюбна, що навіть ваша мишка відчуває себе комфортно.",
        "author": "Автор 3",
        "date": "2024-05-13"
    },
    {
        "id": 5,
        "title": "П'ята стаття: Основи баз даних",
        "slug": "pyata-stattya-osnovy-baz-danyh",
        "content": "SQL – це як паперові записники; NoSQL – як хаос на робочому столі. Вибирайте за настроєм.",
        "author": "Джокер Запитів",
        "date": "2024-05-14"
    },
    {
        "id": 6,
        "title": "Шоста стаття: Основи React",
        "slug": "shosta-stattya-osnovy-react",
        "content": "React – це коли компоненти стають вашими новими найкращими друзями... доки не зламаються.",
        "author": "Автор 5",
        "date": "2024-05-15"
    },
    {
        "id": 7,
        "title": "Сьома стаття: Веб-безпека",
        "slug": "syoma-stattya-veb-bezpeka",
        "content": "XSS та CSRF – звучить як секретні агенти, правда? Ось як захиститися від їхнього вторгнення.",
        "author": "Саркастичний Штирліц",
        "date": "2024-05-16"
    },
    {
        "id": 1747044435422,
        "title": "Стаття про Свиней",
        "slug": "stattya-pro-svyney",
        "content": "Дослідження показують, що ссвині інтелігентні.\nІнколи навіть розумніші за тих, хто залишає ложку в каструлі з борщем.\nВони можуть вивчати трюки, грати в прості комп’ютерні ігри й навіть розпізнавати себе в дзеркалі — що більше, ніж можна сказати про деяких користувачів Facebook.\n\nСвині мають чудову пам’ять, розпізнають імена та запам’ятовують, хто з фермерів годував їх, а хто просто прийшов покурити над головою.\nІ найцікавіше — вони не пишуть код на JavaScript, тож уже на крок ближче до просвітлення.\n\nДехто навіть вважає, що якби свиням дали доступ до Stack Overflow, вони б вже давно автоматизували весь свинарник.",
        "author": "PigletteAI",
        "date": "2025-05-12"
    },
    {
        "id": 1747052244786,
        "title": "Студент, який вважає, що заслуговує всі 8 балів",
        "slug": "student--yakyy-vvazhaye--shcho-zasluhovuye-vsi-8-baliv",
        "content": "Черкаси, Україна — У навчальному закладі стався справжній освітній прорив. Один із студентів, працюючи над проєктом, публічно заявив: “Я один зробив усе завдання і вважаю, що заслуговую на всі 8 балів”.\n\nЗа словами студента, він не лише виконав усю роботу самостійно, а й грамотно використав штучний інтелект як інструмент підтримки, а не як «чарівну кнопку». “ШІ допоміг перевірити граматику, структурувати текст і зробити його більш читабельним — але всі ідеї мої. Я нікому не доручав, не копіював і не списував.”\n\nВикладачі поки не коментують ситуацію, але серед одногрупників хлопець здобув славу \"того, хто тягне все на собі\".\n\n“Такий рівень самостійності треба заохочувати”, — кажуть деякі студенти.\n\nЧи отримає автор усі 8 балів — покаже час. Але одне ясно вже зараз: це не просто оцінка — це принцип.",
        "author": "Просто — Я.",
        "date": "2025-05-12"
    },
    {
        "id": 1747057572031,
        "title": "Мои/влв",
        "slug": "моивлв",
        "content": "Хувирусикусновыирус",
        "author": "Триппи троппа троппа триппи",
        "date": "2025-05-12"
    },
    {
        "id": 1747057977486,
        "title": "Кішка ",
        "slug": "кішка",
        "content": "Ось і все - кішки захопили світ!\n\n\"Мони мене контролюють без можливості врятуватись!\" - каже один з очевидців ",
        "author": "Горщик з рослиною ",
        "date": "2025-05-12"
    }
]